// 地图模拟数据
export const echartsMapList: Array<object> = [
	{ name: '大连老虎滩', value: '100' },
	{ name: '棒棰岛', value: '100' },
	{ name: '大连森林动物园', value: '100' },
	{ name: '发现王国', value: '100' },
	{ name: '铜牛岭', value: '100' },
];

// 地图经纬度数据
export const echartsMapData: object = {
	大连老虎滩: [121.684868, 38.879837],
	棒棰岛: [121.721088, 38.902753],
	大连森林动物园: [121.616453, 38.888824],
	发现王国: [122.009839, 39.08805],
	铜牛岭: [121.789071, 39.040762],
};

// 地图图片显示
export const echartsMapImgs: Array<object> = [
	{
		url: 'https://img1.baidu.com/it/u=4244861097,3561366422&fm=11&fmt=auto&gp=0.jpg',
		name: '大连老虎滩',
		add: '大连市滨海中路9号',
		dec: '大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是大连老虎滩是',
	},
	{
		url: 'https://img1.baidu.com/it/u=3793608028,4006842751&fm=26&fmt=auto&gp=0.jpg',
		name: '大连森林动物园',
		add: '大连市西岗区迎春路60号',
		dec: '大连森林动物园筹建于1992年10月10日 ，1997年6月23日正式对外局部开放。',
	},
	{
		url: 'https://img0.baidu.com/it/u=1406340112,1927292660&fm=26&fmt=auto&gp=0.jpg',
		name: '世界之窗',
		add: '辽宁省大连市金州区金石滩国家旅游度假区金石路36号',
		dec: '这里，世界首座实景拍摄悬空式球幕影院“飞跃美利坚””，为游客提供集休闲放松于一体的都市时尚生活空间。',
	},
	{
		url: 'https://img0.baidu.com/it/u=3042342330,902556630&fm=26&fmt=auto&gp=0.jpg',
		name: '发现王国',
		add: '辽宁省大连市金州区金石滩国家旅游度假区金石路36号',
		dec: '欢乐谷注重满足人们参与、体验的新型诱游需求，营造出自然、清新、活泼、惊奇、热烈、刺激的休闲旅游氛围。',
	},
	{
		url: 'https://img2.baidu.com/it/u=1075072079,1229283519&fm=11&fmt=auto&gp=0.jpg',
		name: '铜牛岭',
		add: '大连市金州区梧桐街8号',
		dec: '大连市金州区梧桐街8号大连市金州区梧桐街8号大连市金州区梧桐街8号大连市金州区梧桐街8号大连市金州区梧桐街8号大连市金州区梧桐街8号大连市金州区梧桐街8号',
	},
];
